SSLD/3-1 3.1 The 4 Content Areas.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 3-1 3.1 The 4 Content Areas
#+begin_verse
We will now be talking about receptive skills.
And when reading the book,
	I noticed that both reception and expression sort of targeted four main content areas
		and they were both the same.
So, they were facts, attitudes, emotions, and needs for both.
And I'm sort of wondering why this similarity?

Okay, so first of all, we probably will have to explain
	why these four content areas of all the possible content areas are chosen, right.
I would say that this is probably based on our experience, helping people manage emotional issues.
Very often, when people were trying to communicate, they want to establish facts.
But then we understand that facts were never totally objective.
If you go to any household and ask who has done a big share of housework,
	you will not have the same answer from everyone.
And if you ask a couple about some simple facts like are we spending enough time together
	and you get very different answers.
	
Because facts are always colored and conditioned by our emotional needs and our attitudes.
And sometimes we will be sort of constructing reality according to our needs and emotional state.
So the reason why we put all this together is,
	we start off with something
		that looks like it is straightforward, objective, neutral and help people appreciate that.
That is not always the case.
And from that onwards, we'll leap onto this idea
	that whatever we are communicating,
		we have to be paying attention to the kind of attitudes that people have taken,
			the values that are weaved into the message,
And very often, emotions are important.
And back to the SSLD core concept, SSLD is always focused on needs,
	because why do we even want to be communicating with each other?
Because there's something that we need from that interaction,
	and there's something that we want to attain or accomplish in that conversation.
So this is why we have got these four content areas chosen.
As mentioned,
	the four key content areas that we should pay attention to when we are listening to others are:
		Facts, which can be subjective, depending on your attitudes and emotions and of course,
			the core concept of the N3C analysis, your needs.
There's often something that we want to accomplish or attain when we engage in conversations,
	and that's because we have needs.
#+end_verse
** expression
receptive [rɪˈseptɪv]: adj. willing to consider new ideas or listen to someone else’s opinions善于接受的, 能接纳的
target [ˈtɑrɡət]: v. to make something have an effect on a particular limited group or area针对
objective [əbˈdʒektɪv]: adj. based on facts, or making a decision that is based on facts rather than on your feelings or beliefs OPP subjective客观的
household [ˈhaʊsˌhoʊld]: n. all the people who live together in one house SYN house一家人, 家庭, 家族, 王室
colored [ˈkʌlə(r)d]: adj. brightly/highly/richly etc coloured having a bright colour such as red, blue, or yellow etc, or a deep shade of a particular colour, but not black, white, or plain有色的
conditioned [kənˈdɪʃ(ə)n]: adj. 有条件的
straightforward [ˌstreɪtˈfɔrwərd]: adj. simple and easy to understand OPP complicated简单的, 易懂的, 直接了当的
neutral [ˈnutrəl]: adj. IN AN ARGUMENT ETC not supporting any of the people or groups involved in an argument or disagreement ⇨ partisan中立的
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交流
attain [əˈteɪn]: v. to succeed in achieving something after trying for a long time得到,达到
subjective [səbˈdʒektɪv] subjectively: adj.adv. a statement, report, attitude etc that is subjective is influenced by personal opinion and can therefore be unfair OPP objective主观的
analysis [əˈnæləsɪs]: n. a careful examination of something in order to understand it better分析
--------------------
from ... onwards: from ... onwards beginning at a particular time or age and continuing after that从那继续
Very often, + ...: 通常, +...
a big share of sth.: 某物的很大一部分
start off with sth.: 以某物开始
leap onto the idea that + ...: 跳跃到这个想法...
take ... attitude: 采取什么的态度
A be weaved into B: A被织入B
be focused on sth.: 专注于某事
