SSLD/3-1 3.1 The 4 Content Areas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-27 Wed 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org2edef6a" class="outline-2">
<h2 id="org2edef6a">3-1 3.1 The 4 Content Areas</h2>
<div class="outline-text-2" id="text-org2edef6a">
<p class="verse">
We will now be talking about receptive skills.<br />
And when reading the book,<br />
&#xa0;I noticed that both reception and expression sort of targeted four main content areas<br />
&#xa0;&#xa0;and they were both the same.<br />
So, they were facts, attitudes, emotions, and needs for both.<br />
And I'm sort of wondering why this similarity?<br />
<br />
Okay, so first of all, we probably will have to explain<br />
&#xa0;why these four content areas of all the possible content areas are chosen, right.<br />
I would say that this is probably based on our experience, helping people manage emotional issues.<br />
Very often, when people were trying to communicate, they want to establish facts.<br />
But then we understand that facts were never totally objective.<br />
If you go to any household and ask who has done a big share of housework,<br />
&#xa0;you will not have the same answer from everyone.<br />
And if you ask a couple about some simple facts like are we spending enough time together<br />
&#xa0;and you get very different answers.<br />
<br />
Because facts are always colored and conditioned by our emotional needs and our attitudes.<br />
And sometimes we will be sort of constructing reality according to our needs and emotional state.<br />
So the reason why we put all this together is,<br />
&#xa0;we start off with something<br />
&#xa0;&#xa0;that looks like it is straightforward, objective, neutral and help people appreciate that.<br />
That is not always the case.<br />
And from that onwards, we'll leap onto this idea<br />
&#xa0;that whatever we are communicating,<br />
&#xa0;&#xa0;we have to be paying attention to the kind of attitudes that people have taken,<br />
&#xa0;&#xa0;&#xa0;the values that are weaved into the message,<br />
And very often, emotions are important.<br />
And back to the SSLD core concept, SSLD is always focused on needs,<br />
&#xa0;because why do we even want to be communicating with each other?<br />
Because there's something that we need from that interaction,<br />
&#xa0;and there's something that we want to attain or accomplish in that conversation.<br />
So this is why we have got these four content areas chosen.<br />
As mentioned,<br />
&#xa0;the four key content areas that we should pay attention to when we are listening to others are:<br />
&#xa0;&#xa0;Facts, which can be subjective, depending on your attitudes and emotions and of course,<br />
&#xa0;&#xa0;&#xa0;the core concept of the N3C analysis, your needs.<br />
There's often something that we want to accomplish or attain when we engage in conversations,<br />
&#xa0;and that's because we have needs.<br />
</p>
</div>
<div id="outline-container-org7725169" class="outline-3">
<h3 id="org7725169">expression</h3>
<div class="outline-text-3" id="text-org7725169">
<p>
receptive [rɪˈseptɪv]: adj. willing to consider new ideas or listen to someone else’s opinions善于接受的, 能接纳的<br />
target [ˈtɑrɡət]: v. to make something have an effect on a particular limited group or area针对<br />
objective [əbˈdʒektɪv]: adj. based on facts, or making a decision that is based on facts rather than on your feelings or beliefs OPP subjective客观的<br />
household [ˈhaʊsˌhoʊld]: n. all the people who live together in one house SYN house一家人, 家庭, 家族, 王室<br />
colored [ˈkʌlə(r)d]: adj. brightly/highly/richly etc coloured having a bright colour such as red, blue, or yellow etc, or a deep shade of a particular colour, but not black, white, or plain有色的<br />
conditioned [kənˈdɪʃ(ə)n]: adj. 有条件的<br />
straightforward [ˌstreɪtˈfɔrwərd]: adj. simple and easy to understand OPP complicated简单的, 易懂的, 直接了当的<br />
neutral [ˈnutrəl]: adj. IN AN ARGUMENT ETC not supporting any of the people or groups involved in an argument or disagreement ⇨ partisan中立的<br />
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交流<br />
attain [əˈteɪn]: v. to succeed in achieving something after trying for a long time得到,达到<br />
subjective [səbˈdʒektɪv] subjectively: adj.adv. a statement, report, attitude etc that is subjective is influenced by personal opinion and can therefore be unfair OPP objective主观的<br />
analysis [əˈnæləsɪs]: n. a careful examination of something in order to understand it better分析<br />
</p>
<hr />
<p>
from &#x2026; onwards: from &#x2026; onwards beginning at a particular time or age and continuing after that从那继续<br />
Very often, + &#x2026;: 通常, +&#x2026;<br />
a big share of sth.: 某物的很大一部分<br />
start off with sth.: 以某物开始<br />
leap onto the idea that + &#x2026;: 跳跃到这个想法&#x2026;<br />
take &#x2026; attitude: 采取什么的态度<br />
A be weaved into B: A被织入B<br />
be focused on sth.: 专注于某事<br />
</p>
</div>
</div>
