SSLD/3-1 3.1 The 4 Content Areas.org
** sentence2
receptive [rɪˈseptɪv]: adj. willing to consider new ideas or listen to someone else’s opinions善于接受的, 能接纳的
- If you don't have basic receptive skills and jump in, you will probably get severely hurt.
- These receptive skills the teacher taught need practicing a great deal.
- The queen was so receptive that she decided to be allied with the king in the north.
target [ˈtɑrɡət]: v. to make something have an effect on a particular limited group or area针对
- Obviously, these TV series were designed to target housewives. 
- Our cookies are supposed to target those people who are reluctant to make breakfast.
- The toothpaste which is designed to target housewives is adored by poor and rich alike.
objective [əbˈdʒektɪv]: adj. based on facts, or making a decision that is based on facts rather than on your feelings or beliefs OPP subjective客观的
- If you run into serious trouble, you'd better calm your nerves and be objective.
- When the queen is in the face of the death of her son, she will never be objective and crucify us all.
- From an objective perspective, you don't have to stay up overnight in the hay.
household [ˈhaʊsˌhoʊld]: n. all the people who live together in one house SYN house一家人, 家庭, 家族, 王室
- No one could account for the fact the mad king killed the household. 
- The household that fought bravely in the battle should have been rewarded with a fief in the east.
- The household that put forward a plan of killing the king in the north at the wedding has been poisoned by one of his widows.
colored [ˈkʌlə(r)d]: adj. brightly/highly/richly etc coloured having a bright colour such as red, blue, or yellow etc, or a deep shade of a particular colour, but not black, white, or plain有色的
- A colored regiment of households won't agree with our fair plan.
- The colored legion has already been killed in action.
- Our warriors died fighting against these colored infantries.
conditioned [kənˈdɪʃ(ə)n]: adj. 有条件的
- Our needs are so subjective that it's often conditioned by our emotions and circumstances.
- Sadly, the love from my father is conditioned.
- Our marriage is conditioned, that you have to offer me one million dollars as a gift.
straightforward [ˌstreɪtˈfɔrwərd]: adj. simple and easy to understand OPP complicated简单的, 易懂的, 直接了当的
- It reminds me of a straightforward saying, one man's meat is another man's poison.
- Your words are always so straightforward that I can't think of what can resist your request.
- Give me a straightforward answer, otherwise, there will still be confusion.
neutral [ˈnutrəl]: adj. IN AN ARGUMENT ETC not supporting any of the people or groups involved in an argument or disagreement ⇨ partisan中立的
- A country that tries to remain neutral will always be beneficial for its people. 
- Remaining neutral, her sister was not tempted into jumping into the battle of the bastards.
- Remaining neutral, he will not stand our side.
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交流
- Our interaction should be kept secret.
- My girlfriend asked to prevent our interaction with our parents.
- There's a very real possibility that our interaction has been found out by our parents.
attain [əˈteɪn]: v. to succeed in achieving something after trying for a long time得到,达到
- I always attain some snacks or pocket money from my grandfather after I have done his work.
- Failing to attain lands from these kings, the nomads pushed their way westward in the plain.
- Because of his obedience, he never fails to attain pocket money from his aunts or uncles.
subjective [səbˈdʒektɪv] subjectively: adj.adv. a statement, report, attitude etc that is subjective is influenced by personal opinion and can therefore be unfair OPP objective主观的
- Why don't you take it subjectively?
- He is so subjective that he always follows his heart when he makes some decisions.
- Being subjective is not equal to spontaneity or following your heart.
analysis [əˈnæləsɪs]: n. a careful examination of something in order to understand it better分析
- A detailed analysis of our sales last year proves his hard work.
- A political analysis of seven kingdoms has revealed his ambition.
- He can't resist the temptation to jump into reading the analysis.
--------------------
from ... onwards: from ... onwards beginning at a particular time or age and continuing after that从...起
- From that day onwards, I never lose my lead in exams in my class.
- From that year onwards, the two countries have been at war with each other.
- From that day onwards, the widow was determined to poison everyone who slaughtered her household.
Very often, + ...: 通常, +...
- Very often, people are unwilling to sacrifice all their savings for the service of surgeons.
- Very often, the officials in the community will put forward a plan to improve our situation.
- Very often, the officious Officer will regard you as a smuggler when you are nervous across the Green Channel.
a big share of sth.: 某物的很大一部分
- A big share of pocket money was exchanged for chocolates in the shop.
- A big share of income in our family comes from our jewelry shop.
- A big share of tourists come here to admire the beautiful scene in the West Lake.
start off with sth.: 以某物开始
- Starting off with Kasha, then he should end up with Kasha.
- Starting off with a series of parades, our celebration has been inaugurated with cheers.
- Starting off with a fight, he began to dominate the battles on the continent.
leap onto the idea that + ...: 跳跃到这个想法...
- The worker leaped onto the idea that the box was so heavy that there must have been something hidden.
- My wife leaped onto the idea that she could go on a vacation at a seaside resort.
- I leaped onto the idea that we invited the household to play hockey in my house.
take ... attitude: 采取什么的态度
- The assistant didn't like the attitude the customer took and told her that it had been sold out.
- The manager will reprimand you for the attitude you took to your customer.
- The positive attitude I had taken after I lost in a game has been reprimanded by my grandfather.
A be weaved into B: A被织入B
- When the king's attitude weaved into his letter comes to London, no one takes it seriously.
- His love for his wife has been waved into letters he sent to her for years.
- The truth of the murder has been weaved into an article which was published by a journalist, the criminal.
be focused on sth.: 专注于某事
- I am focused on finishing my job, don't interrupt me anymore.
- The cat is focused on drinking, so you can touch it softly.
- My grandmother seems to be focused on worship, let's keep quiet.
