SSLD/3-1 3.1 The 4 Content Areas.html
<div id="outline-container-org7124456" class="outline-3">
<h3 id="org7124456">sentence2</h3>
<div class="outline-text-3" id="text-org7124456">
<p>
receptive [rɪˈseptɪv]: adj. willing to consider new ideas or listen to someone else’s opinions善于接受的, 能接纳的<br />
</p>
<ul class="org-ul">
<li>If you don't have basic receptive skills and jump in, you will probably get severely hurt.<br /></li>
<li>These receptive skills the teacher taught need practicing a great deal.<br /></li>
<li>The queen was so receptive that she decided to be allied with the king in the north.<br /></li>
</ul>
<p>
target [ˈtɑrɡət]: v. to make something have an effect on a particular limited group or area针对<br />
</p>
<ul class="org-ul">
<li>Obviously, these TV series were designed to target housewives.<br /></li>
<li>Our cookies are supposed to target those people who are reluctant to make breakfast.<br /></li>
<li>The toothpaste which is designed to target housewives is adored by poor and rich alike.<br /></li>
</ul>
<p>
objective [əbˈdʒektɪv]: adj. based on facts, or making a decision that is based on facts rather than on your feelings or beliefs OPP subjective客观的<br />
</p>
<ul class="org-ul">
<li>If you run into serious trouble, you'd better calm your nerves and be objective.<br /></li>
<li>When the queen is in the face of the death of her son, she will never be objective and crucify us all.<br /></li>
<li>From an objective perspective, you don't have to stay up overnight in the hay.<br /></li>
</ul>
<p>
household [ˈhaʊsˌhoʊld]: n. all the people who live together in one house SYN house一家人, 家庭, 家族, 王室<br />
</p>
<ul class="org-ul">
<li>No one could account for the fact the mad king killed the household.<br /></li>
<li>The household that fought bravely in the battle should have been rewarded with a fief in the east.<br /></li>
<li>The household that put forward a plan of killing the king in the north at the wedding has been poisoned by one of his widows.<br /></li>
</ul>
<p>
colored [ˈkʌlə(r)d]: adj. brightly/highly/richly etc coloured having a bright colour such as red, blue, or yellow etc, or a deep shade of a particular colour, but not black, white, or plain有色的<br />
</p>
<ul class="org-ul">
<li>A colored regiment of households won't agree with our fair plan.<br /></li>
<li>The colored legion has already been killed in action.<br /></li>
<li>Our warriors died fighting against these colored infantries.<br /></li>
</ul>
<p>
conditioned [kənˈdɪʃ(ə)n]: adj. 有条件的<br />
</p>
<ul class="org-ul">
<li>Our needs are so subjective that it's often conditioned by our emotions and circumstances.<br /></li>
<li>Sadly, the love from my father is conditioned.<br /></li>
<li>Our marriage is conditioned, that you have to offer me one million dollars as a gift.<br /></li>
</ul>
<p>
straightforward [ˌstreɪtˈfɔrwərd]: adj. simple and easy to understand OPP complicated简单的, 易懂的, 直接了当的<br />
</p>
<ul class="org-ul">
<li>It reminds me of a straightforward saying, one man's meat is another man's poison.<br /></li>
<li>Your words are always so straightforward that I can't think of what can resist your request.<br /></li>
<li>Give me a straightforward answer, otherwise, there will still be confusion.<br /></li>
</ul>
<p>
neutral [ˈnutrəl]: adj. IN AN ARGUMENT ETC not supporting any of the people or groups involved in an argument or disagreement ⇨ partisan中立的<br />
</p>
<ul class="org-ul">
<li>A country that tries to remain neutral will always be beneficial for its people.<br /></li>
<li>Remaining neutral, her sister was not tempted into jumping into the battle of the bastards.<br /></li>
<li>Remaining neutral, he will not stand our side.<br /></li>
</ul>
<p>
interaction [ˌɪntərˈækʃən]: n. a process by which two or more things affect each other交流<br />
</p>
<ul class="org-ul">
<li>Our interaction should be kept secret.<br /></li>
<li>My girlfriend asked to prevent our interaction with our parents.<br /></li>
<li>There's a very real possibility that our interaction has been found out by our parents.<br /></li>
</ul>
<p>
attain [əˈteɪn]: v. to succeed in achieving something after trying for a long time得到,达到<br />
</p>
<ul class="org-ul">
<li>I always attain some snacks or pocket money from my grandfather after I have done his work.<br /></li>
<li>Failing to attain lands from these kings, the nomads pushed their way westward in the plain.<br /></li>
<li>Because of his obedience, he never fails to attain pocket money from his aunts or uncles.<br /></li>
</ul>
<p>
subjective [səbˈdʒektɪv] subjectively: adj.adv. a statement, report, attitude etc that is subjective is influenced by personal opinion and can therefore be unfair OPP objective主观的<br />
</p>
<ul class="org-ul">
<li>Why don't you take it subjectively?<br /></li>
<li>He is so subjective that he always follows his heart when he makes some decisions.<br /></li>
<li>Being subjective is not equal to spontaneity or following your heart.<br /></li>
</ul>
<p>
analysis [əˈnæləsɪs]: n. a careful examination of something in order to understand it better分析<br />
</p>
<ul class="org-ul">
<li>A detailed analysis of our sales last year proves his hard work.<br /></li>
<li>A political analysis of seven kingdoms has revealed his ambition.<br /></li>
<li>He can't resist the temptation to jump into reading the analysis.<br /></li>
</ul>
<hr />
<p>
from &#x2026; onwards: from &#x2026; onwards beginning at a particular time or age and continuing after that从&#x2026;起<br />
</p>
<ul class="org-ul">
<li>From that day onwards, I never lose my lead in exams in my class.<br /></li>
<li>From that year onwards, the two countries have been at war with each other.<br /></li>
<li>From that day onwards, the widow was determined to poison everyone who slaughtered her household.<br /></li>
</ul>
<p>
Very often, + &#x2026;: 通常, +&#x2026;<br />
</p>
<ul class="org-ul">
<li>Very often, people are unwilling to sacrifice all their savings for the service of surgeons.<br /></li>
<li>Very often, the officials in the community will put forward a plan to improve our situation.<br /></li>
<li>Very often, the officious Officer will regard you as a smuggler when you are nervous across the Green Channel.<br /></li>
</ul>
<p>
a big share of sth.: 某物的很大一部分<br />
</p>
<ul class="org-ul">
<li>A big share of pocket money was exchanged for chocolates in the shop.<br /></li>
<li>A big share of income in our family comes from our jewelry shop.<br /></li>
<li>A big share of tourists come here to admire the beautiful scene in the West Lake.<br /></li>
</ul>
<p>
start off with sth.: 以某物开始<br />
</p>
<ul class="org-ul">
<li>Starting off with Kasha, then he should end up with Kasha.<br /></li>
<li>Starting off with a series of parades, our celebration has been inaugurated with cheers.<br /></li>
<li>Starting off with a fight, he began to dominate the battles on the continent.<br /></li>
</ul>
<p>
leap onto the idea that + &#x2026;: 跳跃到这个想法&#x2026;<br />
</p>
<ul class="org-ul">
<li>The worker leaped onto the idea that the box was so heavy that there must have been something hidden.<br /></li>
<li>My wife leaped onto the idea that she could go on a vacation at a seaside resort.<br /></li>
<li>I leaped onto the idea that we invited the household to play hockey in my house.<br /></li>
</ul>
<p>
take &#x2026; attitude: 采取什么的态度<br />
</p>
<ul class="org-ul">
<li>The assistant didn't like the attitude the customer took and told her that it had been sold out.<br /></li>
<li>The manager will reprimand you for the attitude you took to your customer.<br /></li>
<li>The positive attitude I had taken after I lost in a game has been reprimanded by my grandfather.<br /></li>
</ul>
<p>
A be weaved into B: A被织入B<br />
</p>
<ul class="org-ul">
<li>When the king's attitude weaved into his letter comes to London, no one takes it seriously.<br /></li>
<li>His love for his wife has been waved into letters he sent to her for years.<br /></li>
<li>The truth of the murder has been weaved into an article which was published by a journalist, the criminal.<br /></li>
</ul>
<p>
be focused on sth.: 专注于某事<br />
</p>
<ul class="org-ul">
<li>I am focused on finishing my job, don't interrupt me anymore.<br /></li>
<li>The cat is focused on drinking, so you can touch it softly.<br /></li>
<li>My grandmother seems to be focused on worship, let's keep quiet.<br /></li>
</ul>
</div>
</div>
