SSLD/3-1 3.1 The 4 Content Areas.org
** summary
The receptive skills, reception and expression, both targeted the same four main content areas:
	facts, attitudes, emotions, and needs.
It is actually based on our experience, helping people manage emotional issues.
Very often, people try to establish facts at the beginning of communication.
But facts are so subjective that they are always conditioned by our emotional needs and attitudes.
For example,
	if you ask who has done a big share of housework, you will not have the same answer from everyone.
So whatever we are communicating,
	we have to pay attention to attitudes that people take,
		the values weaved into the message, emotions they have.
Back to SSLD core concept, SSLD is always focused on needs,
	for the reason why we want to commnuicate with each other is
		there is something we need from the interaction.
In sum, the four key content areas are:
	facts which can be subjective, depending on our attitudes, emotions, and our needs.
** summary2
The reception and expression skill both targeted the same four main content areas:
	Facts, attitudes, emotions, and needs.
It is based on our experience, helping people manage emotional issues.
Very often, people try to establish facts at the beginning of communication.
But facts are so subjective that they are always conditioned by our emotional needs and attitudes.
For example, if you ask who has done a big share of the housework,
	you will not get the same answer from everyone.
So whatever we are communicating,
	we have to pay attention to the attitudes that people take,
		the values weaved into the message and the emotions they have.
Back to the SSLD core concept, SSLD is always focused on needs,
	for the reason why we want to communicate with each other is
		there is something we need from the interaction.
In sum, the four key content areas are:
	Facts can be subjective, depending on our attitudes, emotions, and needs.
