SSLD/3-1 3.1 The 4 Content Areas.html
<div id="outline-container-orgf23e879" class="outline-3">
<h3 id="orgf23e879">summary</h3>
<div class="outline-text-3" id="text-orgf23e879">
<p>
The receptive skills, reception and expression, both targeted the same four main content areas:<br />
	facts, attitudes, emotions, and needs.<br />
It is actually based on our experience, helping people manage emotional issues.<br />
Very often, people try to establish facts at the beginning of communication.<br />
But facts are so subjective that they are always conditioned by our emotional needs and attitudes.<br />
For example,<br />
	if you ask who has done a big share of housework, you will not have the same answer from everyone.<br />
So whatever we are communicating,<br />
	we have to pay attention to attitudes that people take,<br />
		the values weaved into the message, emotions they have.<br />
Back to SSLD core concept, SSLD is always focused on needs,<br />
	for the reason why we want to commnuicate with each other is<br />
		there is something we need from the interaction.<br />
In sum, the four key content areas are:<br />
	facts which can be subjective, depending on our attitudes, emotions, and our needs.<br />
</p>
</div>
</div>
<div id="outline-container-org0842029" class="outline-3">
<h3 id="org0842029">summary2</h3>
<div class="outline-text-3" id="text-org0842029">
<p>
The reception and expression skill both targeted the same four main content areas:<br />
	Facts, attitudes, emotions, and needs.<br />
It is based on our experience, helping people manage emotional issues.<br />
Very often, people try to establish facts at the beginning of communication.<br />
But facts are so subjective that they are always conditioned by our emotional needs and attitudes.<br />
For example, if you ask who has done a big share of the housework,<br />
	you will not get the same answer from everyone.<br />
So whatever we are communicating,<br />
	we have to pay attention to the attitudes that people take,<br />
		the values weaved into the message and the emotions they have.<br />
Back to the SSLD core concept, SSLD is always focused on needs,<br />
	for the reason why we want to communicate with each other is<br />
		there is something we need from the interaction.<br />
In sum, the four key content areas are:<br />
	Facts can be subjective, depending on our attitudes, emotions, and needs.<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
